In [1]:
import pandas as pd
import numpy as np

## 1. 데이터 조작하기

In [ ]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_csv("../dataset/customerdata.csv")

In [ ]:
# 컬럼해더 재정의
customerData.columns = ['CUSTID','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

In [ ]:
## 데이터프레임 생성
customerData = pd.DataFrame(customerData)

##### 1-1. 원하는 행 (레코드) 조회하기

In [ ]:
#     데이터프레임명[( 조건식#1 )&(조건식#2)]
#     데이터프레임명.query(‘ 조건식‘)
##     조건 설정
##    조회 후 변수에 대입하여야한다. inplace 적용이 안되기 때문 (원본 데이터 조작 말고 변수에 담으라는 뜻)

In [ ]:
answer1 = customerData[ (customerData.EMI==3) & (customerData.DEVICECOUNT>5) ]
answer2 = customerData.query('EMI == 3 & DEVICECOUNT > 5')

In [ ]:
#     비교 연산자
#     A == B  //  A != B
#     A > B   //  A < B
#     A <= B  //  A <= B
#     A & B   //  A | B

##### 1-2. 데이터프레임 타입변환

In [ ]:
#     데이터프레임 타입확인 → 데이터프레임명.dtypes
#     데이터프레임 타입변환 → 데이터프레임명[‘컬럼명’] = 데이터프레임명[‘컬럼명’].astype(float)

#     변환 타입에 대한 문자열 함수를사용하기 위해서는 .str을 사용해야함 (문자끼리만 붙이기, 떼기가 되므로)

In [ ]:
###   타입 확인하기
customerData.dtypes

In [ ]:
###   타입 변환하기 (int, str, float)
customerData["DEVICECOUNT"] = customerData["DEVICECOUNT"].astype(float)
print(customerData.dtypes)
customerData.head()

##### 실습

kopo_customerdata 데이터 에서
gender == male 이면서 email > 0 인 
데이터를 추출하세요

In [2]:
csData = pd.read_csv("../dataset/kopo_customerdata.csv")
csData.head(2)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0

In [3]:
answer01 = csData[(csData.GENDER=="Male") & (csData.EMAIL > 0)]
answer02 = csData.query('GENDER == "Male" & EMAIL > 0')

In [5]:
answer02.head(2)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0

kopo_product_volume 데이터에서
productgroup == ST0002 이면서 VOLUME > 300000
 데이터를 추출하세요

In [7]:
pvData = pd.read_csv("../dataset/kopo_product_volume.csv")
pvData.head(2)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999

In [9]:
answer04 = pvData[(pvData.PRODUCTGROUP=="ST0002") & (pvData.VOLUME > 30000)]
answer04.head(2)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
1      A01       ST0002    201415  128999
3      A01       ST0002    201418  134467

In [12]:
answer05 = pvData.query('PRODUCTGROUP=="ST0002" & VOLUME > 300000')
answer05.head(2)

   REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
80      A01       ST0002    201452  422468
86      A01       ST0002    201451  356271

##### 1-2. 원하는 컬럼 조회하기

In [ ]:
# 데이터프레임명[ [ ‘컬럼명1’, ‘컬럼명2’ ] ]
# 데이터프레임명.filter(items=[ ‘컬럼명1’, ‘컬럼명2’])

In [14]:
pvData[["YEARWEEK","PRODUCTGROUP"]].head(2)

   YEARWEEK PRODUCTGROUP
0    201415       ST0001
1    201415       ST0002

In [16]:
pvData.filter(items = ["YEARWEEK","PRODUCTGROUP"]).head(2)

   YEARWEEK PRODUCTGROUP
0    201415       ST0001
1    201415       ST0002

kopo_customerdata 테이블에서
customercode, statename, gender, total_amount 컬럼만
추출하세요

In [18]:
csData[["CUSTOMERCODE","STATENAME","GENDER",'TOTAL_AMOUNT']].head(2)

   CUSTOMERCODE STATENAME GENDER  TOTAL_AMOUNT
0       1503989    State2   Male         30300
1       1190338    State2   Male         46500

In [19]:
csData.filter(items = ["CUSTOMERCODE","STATENAME","GENDER",'TOTAL_AMOUNT']).head(2)

   CUSTOMERCODE STATENAME GENDER  TOTAL_AMOUNT
0       1503989    State2   Male         30300
1       1190338    State2   Male         46500

##### 1-3. 인덱스 활용하여 조회하기 (iloc)

In [20]:
#  데이터프레임명.iloc[ : , : ]
# 앞에는 행,인덱스 뒤에는 열. / ' : '만 활용 시 전체

In [22]:
dfc1 = csData.iloc[0:2, :]
dfc1

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0

kopo_customerdata 테이블에서
0~5번째 행의 statename, gender를 선택하세요
(인덱스 활용)

In [29]:
ind1 = csData.columns.get_loc("STATENAME")
ind2 = csData.columns.get_loc("GENDER")

dfc2 = csData.iloc[0:5, [ind1, ind2]]
dfc2

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male

##### 1-4. 이상 데이터 정제하기

In [30]:
#  데이터프레임명[‘컬럼명‘] = np.where( 조건식, yes값, no값)

In [33]:
pvData.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464
3      A01       ST0002    201418  134467
4      A01       ST0001    201413  470040

In [34]:
# numpy 라이브러리 
import numpy as np

#컬럼 추가 생성 및 조건에 따른 컬럼명 변경
pvData["NEW_VOLUME"] = np.where(pvData["VOLUME"] < 500000, 500000, pvData["VOLUME"])
pvData.head(2)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME  NEW_VOLUME
0      A01       ST0001    201415  810144      810144
1      A01       ST0002    201415  128999      500000